{"img_idx": 0, "content": "The ground truth AEROPLANE regions have been segmented in a coarser and incomplete way, especially regarding the wings, and two tiny AEROPLANE patches have been hallucinated on the right edge. The prediction mask for the ground truth PERSON region on the center-bottom-left is slightly more blob-like.\n"}
{"img_idx": 1, "content": "The ground truth AEROPLANE regions have been captured with irregular and erratic boundaries, while some AEROPLANE area has been hallucinated on the bottom of the scene.\n"}
{"img_idx": 2, "content": "The ground truth MONITOR region on the center of the scene has been segmented with somewhat coarser and imperfect boundaries. The bottom and right boundaries of the region are especially flawed.\n"}
{"img_idx": 3, "content": "The prediction masks for the two ground truth TRAIN regions have some coarser boundaries, many details are lost.\n"}
{"img_idx": 4, "content": "The prediction masks for the ground truth BOAT regions are coarser, imprecise and imperfect: the region on the right has been over-segmented a bit, while the region on the center has been slightly under-segmented and the vertical stripe on the right has mostly been missed.\n"}
{"img_idx": 5, "content": "The prediction has many deviations from the ground truth and is overall much more chaotic. The prediction mask of the ground truth DOG region on the center is severily incomplete and irregular. The CHAIR region taking most of the scene has been segmented in a more irregular and erratic way, and the boundaries are inaccurate. Some area have been misclassified as SOFA instead of CHAIR on the top edge, and some has been misclassified as CHAIR instead of DOG in the center.\n"}
{"img_idx": 6, "content": "The prediction mask for the ground truth BIRD region misses the beak towards the top and has a couple of small holes in the center-bottom-left.\n"}
{"img_idx": 7, "content": "The prediction mask for the ground truth MONITOR regions are under-segmented towards the center-bottom (the monitor stands) and on the boundaries of the region towards the center-top and in the right corner. In general, the boundaries are a little less defined.\n"}
{"img_idx": 8, "content": "The prediction mask for the ground truth TRAIN region has some holes scattered within the region, especially on the center. The boundaries are, overall, a little less precise.\n"}
{"img_idx": 9, "content": "The prediction masks for the ground truth PERSON and BIKE regions are overall coarser and more irregular. The body and the handles of the BIKE regions are in general severily under-segmented, while the PERSON regions are segmented in an erratic, inconsistent way.\n"}
{"img_idx": 10, "content": "The prediction mask for the ground truth PERSON region is imperfect, some area has been missed on the bottom-left while some area has been hallucinated on the top edge. Of all the ground truth BOTTLE instances (two on the left half and two on the right half of the scene) have been completely missed by the prediction.\n"}
{"img_idx": 11, "content": "The prediction mask for the ground truth SHEEP region is incomplete in the top-right corner and in the top-left corner. Moreover, The boundaries are imperfect towards the center-bottom and there is some slight over-extension on the center-bottom-right.\n"}
{"img_idx": 12, "content": "The prediction hallucinated several TVMONITOR patches on the right half of the scene.\n"}
{"img_idx": 13, "content": "The ground truth BOAT region on the left has a more blob-like and over-extended shape but its mast has mostly been missed.\n"}
{"img_idx": 14, "content": "The prediction mask for the ground truth AEROPLANE region has some slightly coarser boundaries.\n"}
{"img_idx": 15, "content": "The ground truth DININGTABLE has been segmented with some irregular, erratic and over-extended boundaries in the center of the scene, and the prediction mask for the ground truth BOTTLE region is under-segmented a bit.\n"}
{"img_idx": 16, "content": "The ground truth AEROPLANE region has been segmented with somewhat coarser, less defined boundaries, and these tend to be slightly over-extended, especially on the right.\n"}
{"img_idx": 17, "content": "The boundaries of the prediction mask for the ground truth PERSON region tend to be coarser and over-extended.\n"}
{"img_idx": 18, "content": "The ground truth HORSE region has been segmented with inaccurate boundaries and the leftmost leg near the left-edge is under-segmented a bit. The BACKGROUND areas that interact with the region have been completely misclassified as HORSE.\n"}
{"img_idx": 19, "content": "The prediction mask for the TRAIN region has been under-segmented towards the center-top of the scene.\n"}
{"img_idx": 20, "content": "The ground truth BOTTLE region in the left-center has been segmented in an irregular and erratic way by the prediction, the boundaries are inaccurate and there is some over-segmentation on the bottom-left corner. The ground truth PERSON patch towards the left edge has been completely missed by the prediction.\n"}
{"img_idx": 21, "content": "The ground truth BIRD region has been over-extended along the boundaries and these are coarser and miss some details.\n"}
{"img_idx": 22, "content": "The prediction mask for the ground truth MOTORBIKE region is coarser, the boundaries are less defined, the area surrounding the mirrors on the top-left is over-segmented, the wheel on the left edge has been over-segmented (since the surface internal to the region is filled as MOTORBIKE instead of BACKGROUND). The ground truth PERSON and MOTORBIKE regions on the top-right corner have been segmented in an inaccurate, irregular and blob-like shape, many details of the regions are missed.\n"}
{"img_idx": 23, "content": "The ground truth MOTORBIKE region has been segmented with coarser and less defined boundaries, especially around the handlebar.\n"}
{"img_idx": 24, "content": "The COW region is broken and some parts are missing and hallucinated with HORSE parts, while PERSON regions have been hallucinated with HORSE parts.\n"}
{"img_idx": 25, "content": "Overall, the prediction captures most of the ground truth TRAIN region, however, the top of the train near the center of the scene has been under-segmented, as well as the TRAIN's wheels. Also, a small region of the TRAIN is misclassified as PERSON on the right.\n"}
{"img_idx": 26, "content": "The ground truth CAT region has been segmented with relatively accurate boundaries.\n"}
{"img_idx": 27, "content": "The ground truth BUS region on the center of the scene has been segmented with a lot coarser boundaries and the mask tends to be slightly over-extended on the sides.\n"}
{"img_idx": 28, "content": "The ground truth PERSON region on the center of the scene has been segmented with somewhat coarser and less defined boundaries, the boundaries of the arms are especially flawed.\n"}
{"img_idx": 29, "content": "The prediction mask captured most of the ground truth regions, however, the ground truth CAT region on the top of the scene has been over-extended towards the top.\n"}
{"img_idx": 30, "content": "The ground truth CAT region has been segmented with relatively accurate boundaries. The ground truth CAT region has been segmented with slightly coarser boundaries.\n"}
{"img_idx": 31, "content": "The prediction mask of the PERSON regions on the bottom of the scene is incomplete and coarsely segmented. There are some areas that have been missed, while some parts on the bottom right has been misclassified as DININGTABLE, and the foliage on the top right has been segmented as BICYCLE.\n"}
{"img_idx": 32, "content": "The prediction mask failed to capture the BICYCLE regions on the scene, as most of the BICYCLE has not been segmented at all. Furthermore, a small PERSON region has been hallucinated on the right.\n"}
{"img_idx": 33, "content": "Overall, the prediction captured most of the ground truth regions, however, the ground truth TVMONITOR region on the top left of the scene has been omitted, while the prediction mask of the ground truth DOG region on the center is coarser, and also some SOFA regions are introduced at the bottom, which are not present in the ground-truth.\n"}
{"img_idx": 34, "content": "The ground truth COW region has been segmented with somewhat coarser and imperfect boundaries, especially in the legs.\n"}
{"img_idx": 35, "content": "The ground truth CHAIR region on the right has been segmented with inaccurate boundaries that tend to be over-extended in the prediction. The PERSON region has been segmented with some inaccuracies, particularly on the left leg.\n"}
{"img_idx": 36, "content": "The prediction of the TRAIN region on the scene is incomplete and inaccurate. A significant portion of the TRAIN on the left has been misclassified, partly as AEROPLANE and partly as BACKGROUND.\n"}
{"img_idx": 37, "content": "The ground truth BOAT region has been segmented with a finer, more detailed bottom boundary, while the prediction mask's boundary is coarser and less defined, missing some details.\n"}
{"img_idx": 38, "content": "The prediction mask is quite chaotic, many CHAIR regions have been hallucinated all over the scene, while the DININGTABLE region has been left incomplete and often misclassified as CHAIR.\n"}
{"img_idx": 39, "content": "The prediction mask is very close to the ground truth BUS region, with some very slight under-segmentation.\n"}
{"img_idx": 40, "content": "The PERSON regions have rough borders, presenting overspill and presenting the region in bottom left as BACKGROUND instead of PERSON. The SOFA class is not segmented at all.\n"}
{"img_idx": 41, "content": "The prediction mask is generally consistent with the ground truth, however the borders of the category TRAIN are imprecise, classifying the borders of TRAIN as BACKGROUND, especially towards the center of the image where the subject becomes smaller.\n"}
{"img_idx": 42, "content": "The prediction correctly includes the SOFA region but also interacting objects around the SOFA are segmented as such, especially in the bottom right part of the image.\n"}
{"img_idx": 43, "content": "The prediction mask over the class DOG is mostly correct. The SOFA mask partially covers the correct area of the image but in some areas is incorrectly confused with class CHAIR. In addition the SOFA mask under-segments the ground truth portion of the object. The model confuses a considerable portion back BACKGROUND part of the image in the bottom, near the DOG as SOFA or CHAIR.\n"}
{"img_idx": 44, "content": "The PERSON region in the center of the image is mostly correct, although boundaries with CHAIR have some errors. The top right part of the image is misclassified as PERSON while it should be BACKGROUND. The CHAIR area in the image is poorly segmented as the predicted mask lacks details and the parts interacting with PERSON are mostly misclassified. The DININGTABLE is completely missing from the prediction and in its place, a portion of the subject is misclassified as CHAIR.\n"}
{"img_idx": 45, "content": "The MOTORBIKE region is slightly over-segmented in the prediction, extending a bit in the areas interacting with the PERSON. The PERSON class presents some over-segmentation. The right side of the image present some errors as the BACKGROUND is predicted as PERSON in some cases.\n"}
{"img_idx": 46, "content": "The BOAT region on the left side of the scene is significantly under-segmented. Furthermore, the PERSON region in the right is slightly over-segmented.\n"}
{"img_idx": 47, "content": "The PERSON regions have been segmented with less accuracy compared to the ground truth. Some legs and feet are not clearly segmented. The CHAIR class is not segmented at all and the TVMONITOR region do not cover adequately the subject around its edges. In the bottom right of the image some areas of the BACKGROUND are predicted as DININGTABLE and PERSON.\n"}
{"img_idx": 48, "content": "The ground truth CAT region on the center of the scene has been segmented with slightly inaccurate boundaries, especially on the paw near the bottom-center where the CAT interacts with BACKGROUND. The region in the top left is mispredicted as CAT instead of BACKGROUND.\n"}
{"img_idx": 49, "content": "Overall, the prediction captures the ground truth HORSE region with acceptable accuracy. The boundaries are well-defined and follow the shape of the horse's head closely. The only imperfection is at the top and left of the head, the region boundary is slightly overspilled.\n"}
{"img_idx": 50, "content": "The ground truth region of PERSON on the left is mostly correct: it is slightly over-segmented covering a small part of the CHAIR object interacting with it. The CHAIR mask in the far right of the image is almost entirely missed. The TVMONITOR mask prediction in the top present coarse boundaries.\n"}
{"img_idx": 51, "content": "Although the prediction is mostly in the correct region of the image, the masks do not correctly cover the objects in the image, resulting in an blob. Specifically, the CHAIR mask include BACKGROUND areas and DININGTABLE areas. The DININGTABLE masks is rough and the edges of the object are not correctly segmented .\n"}
{"img_idx": 52, "content": "The prediction of HORSE, while mostly correct, presents errors on the edges, which are rough, especially in the area of interaction with other objects. Notably the class PERSON is correctly predicted in the upper part but is severely under-segmented in the part interacting with HORSE. Moreover, there is an evident error in the prediction of HORSE which should be BACKGROUND around the left part of the image.\n"}
{"img_idx": 53, "content": "The prediction mask of the ground truth SHEEP region has been totally misclassified with classes DOG and COW.\n"}
{"img_idx": 54, "content": "The ground truth SHEEP region has been segmented with coarse, irregular boundaries, especially towards the bottom-right part where it merges with the BACKGROUND.\n"}
{"img_idx": 55, "content": "The ground truth BOAT region on the center of the scene has been segmented with imperfect boundaries, and these tend to be over-extended, especially in the top part. The BACKGROUND areas that interact with the BOAT region have been misclassified as BOAT.\n"}
{"img_idx": 56, "content": "The SHEEP region boundary is imperfect. The prediction is over-extended to the top and to the right of the scene. The PERSON prediction in the bottom left of the image is only partially predicted. The prediction hallucinates small masks of PERSON in the top right corner of the image.\n"}
{"img_idx": 57, "content": "The predicted COW region on the right has been misclassified as AEROPLANE, and the region on the bottom has been misclassified as BOTTLE.\n"}
{"img_idx": 58, "content": "The prediction correctly masks CAT with minor errors towards the edges and the bottom part. The BACKGROUND on the top of the cat is misclassified as CHAIR. The same happens in the lower part.\n"}
{"img_idx": 59, "content": "The prediction of PERSON and MOTORBIKE classes are over-segmented around the edges. The interacting regions between PERSON and MOTORBIKE in the top left half of the image present some noise and imperfections.\n"}
{"img_idx": 60, "content": "The part of the CAT on the top left part of the image is not well segmented, indeed some part of the BACKGROUND has been misclassified as CAT. Furthermore on the right part there is a little bit of noise in the segmentation of the CAT.\n"}
{"img_idx": 61, "content": "The COW is almost completely misclassified. Indeed, there are only the ears and some little parts that are segmented correctly. The prediction shows colors for other things, such as HORSE.\n"}
{"img_idx": 62, "content": "The segmentation is done pretty well apart from the boundaries. Because of this, some details of the BUS are missing.\n"}
{"img_idx": 63, "content": "The BOAT is quite well classified, apart from the borders. The PERSON is not classified at all.\n"}
{"img_idx": 64, "content": "Some small patches of CHAIR class has been hallucinated on the left by the prediction, while the PERSON region on the right has not been captured at all. Besides this, the CAT prediction boundaries are not perfectly defined."}
{"img_idx": 65, "content": "Both the ground truth and the prediction are not segmented 100% correctly. The bottom part of both segmentation does not have defined boundaries. The top part of the prediction is not classified as BOTTLE.\n"}
{"img_idx": 66, "content": "The PLANE is segmented quite well. There are some boundaries that are not perfectly defined in the prediction.\n"}
{"img_idx": 67, "content": "The PERSON region is not predicted not very well. The boundaries are completely misclassified, the PERSON are in some spots misclassified as SOFA and the borders of the SOFA are not well defined.\n"}
{"img_idx": 68, "content": "The BOTTLE is not well classified. There are parts of the table classified as BOTTLE. The CAT's boundaries are not well defined.\n"}
{"img_idx": 69, "content": "The CAR is not segmented perfectly in the prediction. The boundaries are not well delineated as in the ground truth.\n"}
{"img_idx": 70, "content": "The COW's borders are not precise in the ground truth, there are some parts of the BACKGROUND that are misclassified as COW. The right part of the COW in the prediction is not perfectly defined either.\n"}
{"img_idx": 71, "content": "The DININGTABLE and the CHAIRs are poorly segmented in the prediction. The POTTEDPLANT has been completely hallucinated in the prediction.\n"}
{"img_idx": 72, "content": "The ground truth DOG is well segmented, apart from the boundaries, which have many flaws. The prediction misclassified a lot of parts of the DOG, considering also the BACKGROUND and other different elements (such as it classifies a region as AIRPLANE and PERSON that is completely wrong).\n"}
{"img_idx": 73, "content": "The SHEEP are misclassified mostly as BACKGROUND in the prediction. Also the DOG is not classified as DOG in the prediction but as BICYCLE. The PERSON is classified but the borders are not well defined.\n"}
{"img_idx": 74, "content": "The BOTTLE in the ground truth is segmented really bad in the prediction. The borders are coarse and basically there are almost no boundaries. Also some parts of the BACKGROUND are considered as BOTTLE.\n"}
{"img_idx": 75, "content": "The prediction borders of the PERSON are not defined. The AEROPLANE is classified correctly but the boundaries are badly segmented.\n"}
{"img_idx": 76, "content": "The ground truth SOFA region is almost completely misclassified as BACKGROUND. There are only some little parts correctly segmented and predicted as SOFA.\n"}
{"img_idx": 77, "content": "The PERSON are segmented quite well but their boundaries are not well defined and they are merged in one single region. The DININGTABLE has been well segmented, apart from the boundaries, which are not perfect.\n"}
{"img_idx": 78, "content": "The CAR is almost not segmented at all. The boundaries of the PERSON are poorly segmented.\n"}
{"img_idx": 79, "content": "The DOG is well classified apart from one small area nearby the head that is misclassified as DININGTABLE.\n"}
